## Question 1: **Answer**

In [1]:
import sqlite3

In [ ]:
def add_data_to_database():
    try:
        # Connect to the database
        with sqlite3.connect('sales_team.db') as conn:
            cursor = conn.cursor()

           # Create the table
            cursor.execute('''
            CREATE TABLE IF NOT EXISTS sales (
                id INTEGER PRIMARY KEY,
                name TEXT,
                seller_id INTEGER,
                sales_value REAL
            )
            ''' )
            # Insert data into the table
            cursor.executemany('''
            INSERT INTO sales (id, name, seller_id, sales_value) VALUES (?, ?, ?, ?)
            ''', [
                (1, 'John', 101, 20000),
                (2, 'Mary', 102, 50000),
                (3, 'Jerry', 103, 3000),
                (4, 'Jerry', 103, 6000),
                (5, 'John', 101, 15000)
                ]
                )
            conn.commit()
            print("Table created successfully.")
    except Exception as e:
        print(f"Error: {e}")

# Calling the function
add_data_to_database()

Table created successfully.

In [3]:
# Loading SQL extension
%load_ext sql

In [4]:
# Creating a connection to database
%sql sqlite:///sales_team.db

In [5]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [6]:
%%sql
SELECT COUNT(*) AS number_of_rows
FROM sales;

 * sqlite:///sales_team.db
Done.

[(5,)]

## Question 2: **Answer**

In [7]:
%%sql
SELECT
    seller_id,
    name,
    CAST(SUM(sales_value) AS INTEGER) AS total_sales
FROM sales
GROUP BY seller_id, name
ORDER BY total_sales DESC;

 * sqlite:///sales_team.db
Done.

[(102, 'Mary', 50000), (101, 'John', 35000), (103, 'Jerry', 9000)]

## Question 3: **Answer**

In [8]:
%%sql
SELECT
    seller_id,
    name,
    AVG(sales_value) AS average_sales
FROM sales
GROUP BY seller_id, name;

 * sqlite:///sales_team.db
Done.

[(101, 'John', 17500.0), (102, 'Mary', 50000.0), (103, 'Jerry', 4500.0)]

## Question 4: **Answer**

In [9]:
%%sql
SELECT
    seller_id,
    name,
    SUM(sales_value) AS total_sales
FROM  sales
GROUP BY  seller_id, name
HAVING  SUM(sales_value) >= 50000;

 * sqlite:///sales_team.db
Done.

[(102, 'Mary', 50000.0)]

## Question 5: **Answer**

In [10]:
%%sql
SELECT
    seller_id,
    name,
    SUM(sales_value) AS total_sales
FROM  sales
WHERE  name = 'Jerry'
GROUP BY  seller_id, name
HAVING  SUM(sales_value) > 5000;

 * sqlite:///sales_team.db
Done.

[(103, 'Jerry', 9000.0)]